nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/system/main.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @brief File containing FMAC interface specific definitions for the
 * Zephyr OS layer of the Wi-Fi driver.
 */

#include <common/mem_mgmt.h>
#include <stdlib.h>
#include <string.h>

#include <zephyr/kernel.h>
#ifdef CONFIG_NET_L2_ETHERNET
#include <zephyr/net/ethernet.h>
#endif /* CONFIG_NET_L2_ETHERNET */

#include <zephyr/logging/log.h>
#include <zephyr/net/wifi_mgmt.h>

#ifdef CONFIG_NET_CONNECTION_MANAGER_CONNECTIVITY_WIFI_MGMT
#include <zephyr/net/conn_mgr_connectivity.h>
#include <zephyr/net/conn_mgr_connectivity_impl.h>
#include <zephyr/net/conn_mgr/connectivity_wifi_mgmt.h>
#endif /* CONFIG_NET_CONNECTION_MANAGER_CONNECTIVITY_WIFI_MGMT */

#include <common/status.h>
#include <common/rf_params.h>
#include <common/vtf.h>
#include <common/util.h>
#include <system/core.h>
#include <drivers/wifi/nrf71/nrf71_wifi_coex.h>

#ifdef CONFIG_NRF71_STA_MODE
#include <zephyr/net/wifi_nm.h>
#include <system/wifi_mgmt_scan.h>
#include <system/wifi_mgmt.h>
#include <system/wpa_supp_if.h>
#else /* CONFIG_NRF71_STA_MODE */
#include <system/wifi_mgmt_scan.h>
#include <system/wifi_mgmt.h>
#endif /* !CONFIG_NRF71_STA_MODE */

#include <system/fmac_api.h>
#include <common/fw_if/nrf71_wifi_rf.h>

#define DT_DRV_COMPAT nordic_wlan
LOG_MODULE_REGISTER(wifi_nrf, CONFIG_WIFI_NRF71_LOG_LEVEL);

struct nrf_wifi_drv_priv_zep rpu_drv_priv_zep;

/* 3 bytes for addreess, 3 bytes for length */
#define MAX_PKT_RAM_TX_ALIGN_OVERHEAD 6

#ifdef CONFIG_NRF71_DATA_TX

#define MAX_TX_FRAME_SIZE \
	(CONFIG_NRF_WIFI_IFACE_MTU + NRF_WIFI_FMAC_ETH_HDR_LEN + TX_BUF_HEADROOM)
#define TOTAL_TX_SIZE \
	(CONFIG_NRF71_MAX_TX_TOKENS * CONFIG_NRF71_TX_MAX_DATA_SIZE)
#define TOTAL_RX_SIZE \
	(CONFIG_NRF71_RX_NUM_BUFS * CONFIG_NRF71_RX_MAX_DATA_SIZE)

BUILD_ASSERT(CONFIG_NRF71_MAX_TX_TOKENS >= NRF_WIFI_FMAC_AC_MAX,
	"At least one TX token per access category is required");
BUILD_ASSERT(CONFIG_NRF71_MAX_TX_AGGREGATION <= 15,
	"Max TX aggregation is 15");
BUILD_ASSERT(CONFIG_NRF71_TX_MAX_DATA_SIZE >= MAX_TX_FRAME_SIZE,
	"TX buffer size must be at least as big as the MTU and headroom");

BUILD_ASSERT(CONFIG_NRF71_TX_MAX_DATA_SIZE % 4 == 0,
	"TX buffer size must be a multiple of 4");

static const unsigned char aggregation = 1;
static const unsigned char max_num_tx_agg_sessions = 4;
static const unsigned char max_num_rx_agg_sessions = 8;
static const unsigned char reorder_buf_size = CONFIG_NRF71_RX_NUM_BUFS / 2;
static const unsigned char max_rxampdu_size = MAX_RX_AMPDU_SIZE_64KB;

static const unsigned char max_tx_aggregation = CONFIG_NRF71_MAX_TX_AGGREGATION;

static const unsigned char rate_protection_type;
#endif /* CONFIG_NRF71_DATA_TX */

BUILD_ASSERT(CONFIG_NRF71_RX_MAX_DATA_SIZE % 4 == 0,
	"RX buffer size must be a multiple of 4");

#define MAX_RX_QUEUES 3

static const unsigned int rx1_num_bufs = CONFIG_NRF71_RX_NUM_BUFS / MAX_RX_QUEUES;
static const unsigned int rx2_num_bufs = CONFIG_NRF71_RX_NUM_BUFS / MAX_RX_QUEUES;
static const unsigned int rx3_num_bufs = CONFIG_NRF71_RX_NUM_BUFS / MAX_RX_QUEUES;

static const unsigned int rx1_buf_sz = CONFIG_NRF71_RX_MAX_DATA_SIZE;
static const unsigned int rx2_buf_sz = CONFIG_NRF71_RX_MAX_DATA_SIZE;
static const unsigned int rx3_buf_sz = CONFIG_NRF71_RX_MAX_DATA_SIZE;

struct nrf_wifi_drv_priv_zep rpu_drv_priv_zep;
static K_MUTEX_DEFINE(reg_lock);

static void nrf_wifi_event_proc_scan_start_zep(
	void *if_priv,
	struct nrf_wifi_umac_event_trigger_scan *scan_start_event,
	unsigned int event_len)
{
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;

	vif_ctx_zep = if_priv;

	if (vif_ctx_zep->scan_type == SCAN_DISPLAY) {
		return;
	}

#ifdef CONFIG_NRF71_STA_MODE
	nrf_wifi_wpa_supp_event_proc_scan_start(if_priv);
#endif /* CONFIG_NRF71_STA_MODE */
}

void nrf_wifi_event_proc_scan_done_zep(void *vif_ctx,
				       struct nrf_wifi_umac_event_scan_done *scan_done_event,
				       unsigned int event_len)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;

	vif_ctx_zep = vif_ctx;

	if (!vif_ctx_zep) {
		LOG_ERR("%s: vif_ctx_zep is NULL", __func__);
		return;
	}

	LOG_DBG("%s: scan_done_event->scan_results_cnt = %d, scan_type = %d",
		__func__, scan_done_event->scan_results_cnt, vif_ctx_zep->scan_type);
	switch (vif_ctx_zep->scan_type) {
#ifdef CONFIG_NET_L2_WIFI_MGMT
	case SCAN_DISPLAY:
		memcpy(&vif_ctx_zep->scan_done_event, scan_done_event, event_len);
		/* Schedule scan result processing in system workqueue to avoid deadlock */
		k_work_submit(&vif_ctx_zep->disp_scan_res_work);
		break;
#endif /* CONFIG_NET_L2_WIFI_MGMT */
#ifdef CONFIG_NRF71_STA_MODE
	case SCAN_CONNECT:
#ifdef CONFIG_NRF_WIFI_CONNECT_SCAN_RESULTS_GDRAM
		/* Cache for the get scan results call, under vif_lock as the
		 * supplicant path reads and frees it; free any unread previous one.
		 */
		k_mutex_lock(&vif_ctx_zep->vif_lock, K_FOREVER);
		if (vif_ctx_zep->connect_scan_db_addr) {
			nrf_wifi_mem_free(NRF_WIFI_MEM_POOL_TYPE_CTRL,
				(void *)(uintptr_t)vif_ctx_zep->connect_scan_db_addr);
		}
		vif_ctx_zep->connect_scan_db_addr = scan_done_event->scan_db_addr;
		vif_ctx_zep->connect_scan_res_cnt = scan_done_event->scan_results_cnt;
		k_mutex_unlock(&vif_ctx_zep->vif_lock);
#endif /* CONFIG_NRF_WIFI_CONNECT_SCAN_RESULTS_GDRAM */
		nrf_wifi_wpa_supp_event_proc_scan_done(vif_ctx_zep,
						       scan_done_event,
						       event_len,
						       0);
		break;
#endif /* CONFIG_NRF71_STA_MODE */
	default:
		LOG_ERR("%s: Scan type = %d not supported yet", __func__, vif_ctx_zep->scan_type);
		return;
	}

	status = NRF_WIFI_STATUS_SUCCESS;
}

static void nrf_wifi_scan_timeout_work(struct k_work *work)
{
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	vif_ctx_zep = CONTAINER_OF(work, struct nrf_wifi_vif_ctx_zep, scan_timeout_work.work);

	if (!vif_ctx_zep->scan_in_progress) {
		LOG_INF("%s: Scan not in progress", __func__);
		return;
	}

